Revit 2027 API
DocumentSynchronizingWithCentralEventArgs.Options Property
 User's options associated with the synchronization operation.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SynchronizeWithCentralOptions Options { get; }
Public ReadOnly Property Options As SynchronizeWithCentralOptions
	Get
public:
property SynchronizeWithCentralOptions^ Options {
	SynchronizeWithCentralOptions^ get ();
}
member Options : SynchronizeWithCentralOptions with get
Property Value
SynchronizeWithCentralOptions
See Also
Reference
DocumentSynchronizingWithCentralEventArgs Class
Autodesk.Revit.DB.Events Namespace